import React, {Component} from "react"
import './Main.css'

class Main extends Component{

    render() {
        return (
            <div className="main">
                <div className="main__1">
                    <h1>Условия использования</h1>

                    <p>
                        Эти условия использования веб-сайта и Услуг Adrenaline Drive (далее «Условия использования»), которые регулируют ваши взаимоотношения с Adrenaline Drive.  Пожалуйста прочитайте их внимательно. Открывая, используя этот Веб-сайт или использую услуги Adrenaline Drive вы признаёте, что внимательно прочитали, поняли и принимаете все положения содержащиеся в этих Условия использования. Если вы не согласны или не можете соблюдать все или часть этих Условий использования или если у вас нет права или полномочий вступать в соглашение с Adrenaline Drive, вы должны воздерживаться от открытия или использования этого Веб-сайта и услуг компании Adrenaline Drive.
                    </p>

                    <p>
                        <strong>
                            «Adrenaline Drive»
                        </strong> - торговое наименование ООО⠀
                        <strong>
                            «Адреналін Драйв»
                        </strong>⠀юридического лица, зарегистрированного в Украине под своим регистрационным номером 43293322. Любые ссылки на Adrenaline Drive относятся к ООО
                        <strong>
                            «Адреналін Драйв»
                        </strong>.
                    </p>

                    <p>
                        <strong>
                            «Веб-сайт»
                        </strong> - вебсайт⠀
                        <a href="https://www.a-drive.com.ua">
                            https://www.a-drive.com.ua
                        </a>, включая весь его контент.
                    </p>

                    <p>
                        <strong>
                            «Вы», «Ваш», «Ваш»
                        </strong> относится к любому пользователю Услуг Adrenaline Drive.
                    </p>

                    <p>
                        <strong>
                            «Мы», «Наши» и «Нас»
                        </strong> означают «Adrenaline Drive».
                    </p>

                    <p>
                        <strong>
                            «Договор публичной оферты»
                        </strong> – публичный договор, условия которого одинаковы для всех пользователей, который регулирует предоставление Услуг Adrenaline Drive и к которому вы присоединяетесь, подписывая соответствующее заявление перед предоставлением услуг Adrenaline Drive.
                    </p>

                    <p>
                        <strong>
                            «Услуги»
                        </strong> - услуги Adrenaline Drive по предоставлению в аренду автомобилей с целью тест-драйва, сопровождения мероприятий, проведения фотосессий, а также вспомогательные услуги, которые могут быть предоставлены Adrenaline Drive по согласованию с заказчиком.
                    </p>

                    <h1>Договор</h1>

                    <p>
                        Услуги Adrenaline Drive предоставляются на основании Договора публичной оферты. Используя услуги Adrenaline Drive вы должны принять условия указанного Договора Публичной оферты путем подписания Заявления на присоедините к Договору публичной оферты. Вы должны иметь при себе документы, удостоверяющие личность для оформления договора.
                    </p>

                    <p>
                        Вы также должны ознакомится и соблюдать правила проведения тест-драйва⠀
                        <a href="https://www.a-drive.com.ua/pdf/rules-ua.pdf">
                            https://www.a-drive.com.ua/pdf/rules-ua.pdf
                        </a> (далее «Правила»).
                    </p>

                    <p>
                        В случае если эти Условия Использования противоречат Договору публичной оферты, последний должен иметь преимущественную силу.
                    </p>

                    <h1>Услуги</h1>

                    <p>
                        Услуги Adrenaline Drive предоставляются исключительно на территории и по маршрутам, указанным в Договоре публичной оферты и Правилах.
                    </p>

                    <p>Вам может быть отказано в предоставлении услуг если:</p>

                    <ul>
                        <li>у вас нет водительского удостоверения или водительский стаж менее 2 лет;</li>
                        <li>если вы не достигли возраста 21 года, или ваш возраст старше 65 лет;</li>
                        <li>вы не соблюдаете правила дорожного движения;</li>
                        <li>вы находитесь в состоянии алкогольного, наркотического или токсического опьянения;</li>
                        <li>вы не соблюдаете разумных требования представителя Adrenaline Drive.</li>
                    </ul>

                    <h1>Платежи и цены</h1>

                    <p>
                        Предоставление услуг Adrenaline Drive осуществляется на основании полной предоплаты. Цены на Услуги Adrenaline Drive могут отличаться от цен указанных на Веб-сайте.
                    </p>

                    <p>
                        Окончательная цена услуг определяется в зависимости от типа услуг и фиксируется в Заявлении на присоединение к Договору Публичной оферты.
                    </p>

                    <p>
                        Подробные условия оплаты вы можете найти в Договоре публичной оферты или связавшись с нашими представителями в соответствии с разделом «Контакты».
                    </p>

                    <h1>Контент сайта</h1>

                    <p>
                        Данный Веб-сайт и все материалы на этом Веб-сайте, включая текст, изображения, иллюстрации, рисунки, значки, фотографии, видеоклипы, программный код, а также программное обеспечение, используемое для предоставления услуг Adrenaline Drive (совместно именуемое⠀
                        <strong>«Контент»</strong>
                        ), является собственностью, контролируется или лицензируется Adrenaline Drive. Вы признаете, что Adrenaline Drive владеет или имеет лицензию на использование всех прав на Веб-сайт и его Контент. Ни при каких обстоятельствах вы не приобретаете какие-либо права на любую часть Веб-сайта или Контента.
                    </p>

                    <h1>Ограничение на использование Контента</h1>

                    <p>
                        Этот сайт предназначен для рекламирования, продвижения Услуг Adrenaline Drive и информирования пользователей об условия их предоставления. Вы не можете воспроизводить, хранить, делиться или распространять любой Контент, содержащейся на Веб-сайте, полностью или частично, без нашего предварительного письменного согласия или согласия соответствующего владельца. Вы не имеете права модифицировать, создавать производные работы, демонтировать, разбирать, рекомпилировать или осуществлять реинжиниринг любой части Веб-сайта, а также осуществлять доступ или использовать Веб-сайт для создания аналогичного или конкурентоспособного продукта или услуги.
                    </p>
                </div>

                <div className="main__car">
                    <img
                        src={require("../../img/ford.webp")}
                        alt="Ford"
                        className="car__ford"/>
                </div>

                <div className="main__2">
                    <h1>Права интеллектуальной собственности</h1>

                    <p>
                        Adrenaline Drive сохраняет за собой право собственности и все права интеллектуальной собственности (включая все авторские права, патенты, права на сервисные знаки, товарные знаки и другие права на интеллектуальную собственность) на Веб-сайте и его Контент. Название и логотипы Adrenaline Drive, другие знаки, графические изображения, используемые или отображаемые на Веб-сайте или через него, являются товарными знаками Adrenaline Drive. Вы не должны копировать или использовать какие-либо из вышеупомянутых товарных знаков без нашего предварительного письменного согласия.
                    </p>

                    <h1>Ошибки и неточности Веб-сайта</h1>

                    <p>
                        Adrenaline Drive не гарантирует, что использование Веб-сайта будет бесперебойным или безошибочным. Иногда на Веб-сайте может находиться информация, содержащая опечатки, неточности или упущения, которые могут относиться к описанию продукта, ценам, рекламным акциям, предложениям и доступности. Мы оставляем за собой право исправлять любые ошибки, неточности или упущения, а также изменять или обновлять информацию, если какая-либо информация на этом Веб-сайте является неточной в любое время. Adrenaline Drive не несет ответственности за любое такое вмешательство в работу или отсутствие доступа к Веб-сайту.
                    </p>

                    <h1>Сообщения от Adrenaline Drive</h1>

                    <p>
                        Принимая настоящие Условия использования, вы в прямо даете свое согласие на получение уведомлений и сообщений в электронном виде в отношении использования вами Веб-сайта или услуг Adrenaline Drive. Пожалуйста, ознакомьтесь с нашей Политикой Конфиденциальности, чтобы узнать больше об использовании и обработке информации, которую вы предоставляете Adrenaline Drive.
                    </p>

                    <h1>Конфиденциальность</h1>

                    <p>
                        Любые ваши данные, переданные или собранные Adrenaline Drive будут оставаться конфиденциальными в соответствии с соглашением с Adrenaline Drive. Мы будем использовать ваши данные исключительно с целью предоставления вам услуг и в соответствии с нашей Политикой Конфиденциальности. Мы не будем раскрывать такую информацию третьим лицам, за исключением наших сотрудников и/или субподрядчиков, которые связаны аналогичными обязательствами по сохранению конфиденциальности или если этого требует закон.
                    </p>

                    <h1>Ограничение ответственности</h1>

                    <p>
                        Adrenaline Drive не несет ответственности в отношении любого предмета этих Условий использования или связанных с ним условий, договоров, соглашений за любые непрямые, случайные или косвенные убытки, включая, помимо прочего, потерю доходов и прибыли или за обстоятельства, возникшее в результате форс-мажора.
                    </p>

                    <p>
                        Кроме случаев, прямо указанных в Договоре публичной оферты, Adrenaline Drive отказывается от всех заявлений, гарантий и условий, явных или подразумеваемых, возникающих в связи с законом, торговыми обычаями, деловыми отношениями или иным образом, включая гарантии коммерческой ценности или пригодности для конкретной цели Услуг Adrenaline Drive.
                    </p>

                    <p>
                        Никакие заявления любого рода, сделанные Adrenaline Drive, которые прямо не указаны в этих Условиях или Договоре публичной оферты или в какой-либо письменном дополнительном соглашении к нему, не являются обязательными для Adrenaline Drive.
                    </p>

                    <p>
                        Adrenaline Drive не несет ответственности за убытки возникающие в результате использования, неправильного использования, невозможности использования Веб-сайта и Контента по какой-либо причине. Такое ограничение применяется в полной мере, допускаемой законом.
                    </p>

                    <h1>Форс-мажор</h1>

                    <p>
                        Ни одна из Сторон не несет ответственности перед другой стороной за любую задержку или неисполнение каких-либо обязательств, указанных в настоящих Условиях или любых его приложениях в связи с обстоятельствами непреодолимой силы, в т.ч. с решениями правительства.
                    </p>
                </div>

                <div className="main__car">
                    <img
                        src={require("../../img/nissan.webp")}
                        alt="Nissan"
                        className="car__nissan"/>
                </div>

                <div className="main__3">
                    <h1>Возмещение Убытков</h1>

                    <p>
                        Вы обязуетесь возмещать Adrenaline Drive и его должностным лицам любые убытки, затраты, штрафы и расходы, возникающие в связи с нарушением вами любого закона, нарушением любых положений этих Условий использования или претензиями третьих лиц, связанных с использованием Услуг Adrenaline Drive.
                    </p>

                    <p>
                        В случае нанесения убытков имуществу Adrenaline Drive или третьих лиц, вы обязуетесь возместить нанесенные убытки и освобождаете Adrenaline Drive и его представителей от ответственности перед третьими лицами, которым нанесен ущерб.
                    </p>

                    <h1>Сторонние продукты и ссылки</h1>

                    <p>
                        Сайт может содержать предложения, продукты и услуги третьих лиц, а также ссылки на другие сайты. Adrenaline Drive не несет ответственности за какие-либо продукты или услуги третьих сторон, а также за содержание или политику конфиденциальности этих третьих сторон. Перед использованием сторонних сайтов рекомендуется прочитать и понять положения и условия этих сайтов / продуктов / услуг и политику конфиденциальности, чтобы убедиться, что вы согласны с их условиями.
                    </p>

                    <h1>Применимое законодательство</h1>

                    <p>
                        Эти Условия использования и правоотношения между сторонами регулируются и толкуются в соответствии с законодательством Украины. Стороны прилагают все усилия для урегулирования всех споров путем переговоров.
                    </p>

                    <p>
                        Если какое-либо из положений этих Условий использования является или становится незаконным, неисполнимым или недействительным (полностью или частично по любой причине), остальная часть Условий использования остается в полной силе и действии и не признается недействительной каким-либо образом.
                    </p>

                    <h1>Уведомления и Изменения</h1>

                    <p>
                        Adrenaline Drive может изменить эти Условия использования и любые другие политики на нашем Веб-сайте в любое время и что размещение измененных условий или политик на нашем Веб-сайте будет являться достаточным уведомлением о таких изменениях. Обновленная версия вступает в силу немедленно и будет отмечена обновленной датой в конце такого документа. Вы не должны продолжать использовать Веб-сайт или услуги Adrenaline Drive, если вы не принимаете такие изменения.
                    </p>

                    <h1>Контакты</h1>

                    <p>
                        Если у вас есть вопросы, касающиеся использования этого Веб-сайта или услуг Adrenaline Drive пожалуйста свяжитесь с нами по адресу электронной почты:⠀
                        <br/><br/>
                        <a href="mailto:info@a-drive.com.ua">info@a-drive.com.ua</a>
                    </p>

                    <p>Последнее изменение 18 апреля 2020</p>
                </div>
            </div>
        )
    }
}

export default Main