import React, {Component} from "react"
import './Main.css'

class Main extends Component{

    render() {
        return (
            <div className="main">
                <div className="main__1">
                    <h1>Умови використання</h1>

                    <p>
                        Ці умови використання веб-сайту та Послуг Adrenaline Drive (далі «Умови використання»),
                        які регулюють ваші взаємини з Adrenaline Drive.
                        Будь ласка, прочитайте їх уважно.
                        Відкриваючи, використовуючи цей Веб-сайт або використовую послуги Adrenaline Drive ви визнаєте,
                        що уважно прочитали, зрозуміли і приймаєте всі положення, що містяться в цих Умови використання.
                        Якщо ви не згодні або не можете дотримуватися усіх або частини цих Умов використання
                        або якщо у вас немає права або повноважень вступати в угоду з Adrenaline Drive,
                        ви повинні утримуватися від відкриття або використання цього Веб-сайту
                        та послуг компанії Adrenaline Drive.
                    </p>

                    <p>
                        <strong>
                            «Adrenaline Drive» - Товариство з обмеженою відповідальністю «Адреналін Драйв»
                        </strong>,
                        код ЄДРПОУ 43293322, місцезнаходження якого: 01024, м. Київ, вул. Круглоуніверсітетська, буд.7, офіс 29.
                        Будь-які посилання на Adrenaline Drive відносяться до ТОВ
                        <strong>
                            «Адреналін Драйв»
                        </strong>.
                    </p>

                    <p>
                        <strong>
                            «Веб-сайт»
                        </strong> - вебсайт⠀
                        <a href="https://www.a-drive.com.ua">
                            https://www.a-drive.com.ua
                        </a>, включаючи весь його контент.
                    </p>

                    <p>
                        <strong>
                            «Ви», «Ваш», «Ваш»
                        </strong> відноситься до будь-якого користувача Послуг Adrenaline Drive.
                    </p>

                    <p>
                        <strong>
                            «Ми», «Наші» і «Нас»
                        </strong> означають «Adrenaline Drive».
                    </p>

                    <p>
                        <strong>
                            «Договір публічної оферти»
                        </strong> - публічний договір,
                        умови якого однакові для всіх користувачів,
                        який регулює надання Послуг Adrenaline Drive і до якого ви приєднуєтеся,
                        підписуючи відповідну заяву перед наданням послуг Adrenaline Drive.
                    </p>

                    <p>
                        <strong>
                            «Послуги»
                        </strong> - послуги Adrenaline Drive з надання в оренду автомобілів з метою тест-драйву,
                        супроводу заходів, проведення фотосесій, а також допоміжні послуги,
                        які можуть бути надані Adrenaline Drive за погодженням із замовником.
                    </p>

                    <h1>Договір</h1>

                    <p>
                        Послуги Adrenaline Drive надаються на підставі Договору публічної оферти.
                        Використовуючи послуги Adrenaline Drive ви повинні прийняти умови зазначеного
                        Договору Публічної оферти шляхом підписання Заяви на приєднання до Договору публічної оферти.
                        Ви повинні мати при собі документи, що засвідчують особу для оформлення договору.
                    </p>

                    <p>
                        Ви також повинні ознайомиться і дотримуватися правил проведення тест-драйву⠀
                        <a href="https://www.a-drive.com.ua/pdf/rules-ua.pdf">
                            https://www.a-drive.com.ua/pdf/rules-ua.pdf
                        </a> (далі «Правила»).
                    </p>

                    <p>
                        У разі якщо ці Умови використання суперечать Договору публічної оферти,
                        останній повинен мати переважну силу.
                    </p>

                    <h1>Послуги</h1>

                    <p>
                        Послуги Adrenaline Drive надаються виключно на території і за маршрутами,
                        вказаними в Договорі публічної оферти і Правилах.
                    </p>

                    <p>Вам може бути відмовлено в наданні Послуг якщо:</p>

                    <ul>
                        <li>у вас немає посвідчення водія або водійський стаж менше 2 років;</li>
                        <li>якщо ви не досягли віку 21 років, або ваш вік старше 65 років;</li>
                        <li>ви не дотримуєтеся правил дорожнього руху;</li>
                        <li>ви перебуваєте в стані алкогольного, наркотичного або токсичного сп'яніння;</li>
                        <li>ви не дотримуєтесь розумних вимог представника Adrenaline Drive.</li>
                    </ul>

                    <h1>Платежі і ціни</h1>

                    <p>
                        Надання послуг Adrenaline Drive здійснюється на підставі повної передоплати.
                        Ціни на Послуги Adrenaline Drive можуть відрізнятися від цін вказаних на Веб-сайті.
                    </p>

                    <p>
                        Остаточна ціна послуг визначається в залежності від типу послуг і фіксується
                        в Заяві на приєднання до Договору Публічної оферти.
                    </p>

                    <p>
                        Детальні умови оплати ви можете знайти в Договорі публічної оферти або
                        зв'язавшись з нашими представниками відповідно до розділу «Контакти».
                    </p>

                    <h1>Контент Веб-сайту</h1>

                    <p>
                        Даний Веб-сайт і всі матеріали на цьому Веб-сайті, включаючи текст,
                        зображення, ілюстрації, малюнки, значки, фотографії, відеокліпи,
                        програмний код, а також програмне забезпечення, що використовується для надання послуг Adrenaline Drive (далі⠀
                        <strong>«Контент»</strong>), є власністю, контролюється або ліцензується Adrenaline Drive.
                        Ви визнаєте, що Adrenaline Drive володіє або має ліцензію на використання всіх прав на Веб-сайт і його Контент.
                        Ні в якому разі ви не здобуваєте будь-які права на будь-яку частину Веб-сайту або Контенту.
                    </p>

                    <h1>Обмеження на використання Контенту</h1>

                    <p>
                        Цей Веб-сайт призначений для рекламування, просування Послуг Adrenaline Drive
                        і інформування користувачів про умови їх надання.
                        Ви не можете відтворювати, зберігати, ділитися або поширювати будь-який Контент,
                        що міститься на Веб-сайті, повністю або частково, без нашої попередньої письмової згоди
                        або згоди її власника. Ви не маєте права модифікувати, створювати похідні роботи,
                        демонтувати, розбирати, рекомпілювати або здійснювати реінжиніринг будь-якої частині Сайту,
                        а також здійснювати доступ до Веб-сайт або використовувати Веб-сайт для створення аналогічного
                        або конкурентного продукту або послуги.
                    </p>
                </div>

                <div className="main__car">
                    <img
                        src={require("../../img/ford.png")}
                        alt="Ford"
                        className="car__ford"/>
                </div>

                <div className="main__2">
                    <h1>Права інтелектуальної власності</h1>

                    <p>
                        Adrenaline Drive зберігає за собою право власності
                        і всі права інтелектуальної власності (включаючи всі авторські права, патенти,
                        права на сервісні знаки, товарні знаки та інші права на інтелектуальну власність)
                        на Веб-сайті та його Контент.
                        Назва і логотипи Adrenaline Drive, інші знаки, графічні зображення,
                        які використовуються або відображаються на Веб-сайті або через нього,
                        є товарними знаками Adrenaline Drive.
                        Ви не повинні копіювати або використовувати будь-які з вищезазначених товарних знаків
                        без нашої попередньої письмової згоди.
                    </p>

                    <h1>Помилки та неточності Веб-сайту</h1>

                    <p>
                        Adrenaline Drive не гарантує,
                        що використання Веб-сайту буде безперебійним або безпомилковим.
                        Іноді Веб-сайт може містити інформацію, яка включає помилки, неточності або упущення,
                        які можуть відноситись до опису продукту, цін, рекламних акцій, пропозицій і доступності.
                        Ми залишаємо за собою право виправляти будь-які помилки, неточності або упущення,
                        а також змінювати або оновлювати інформацію,
                        якщо будь-яка інформація на цьому Веб-сайті є неточною в будь-який час.
                        Adrenaline Drive не несе відповідальності за будь-яке таке втручання в роботу
                        або відсутність доступу до веб-сайту.
                    </p>

                    <h1>Повідомлення від Adrenaline Drive</h1>

                    <p>
                        Приймаючи ці Умови використання,
                        ви в прямо даєте свою згоду на отримання повідомлень в електронному вигляді
                        щодо використання вами Веб-сайту або послуг Adrenaline Drive.
                        Будь ласка, ознайомтеся з нашою Політикою Конфіденційності,
                        щоб дізнатися більше про використання та обробку інформації,
                        яку ви надаєте Adrenaline Drive.
                    </p>

                    <h1>Конфіденційність</h1>

                    <p>
                        Будь-які ваші дані, передані або зібрані Adrenaline Drive залишатимуться
                        конфіденційними відповідно до угоди з Adrenaline Drive.
                        Ми будемо використовувати ваші дані виключно з метою надання вам послуг
                        і відповідно до нашої Політики Конфіденційності.
                        Ми не будемо розкривати таку інформацію третім особам,
                        за винятком наших співробітників і / або субпідрядників,
                        які пов'язані аналогічними зобов'язаннями щодо збереження конфіденційності
                        або якщо цього вимагає закон.
                    </p>

                    <h1>Обмеження Відповідальності</h1>

                    <p>
                        Adrenaline Drive не несе відповідальності щодо будь-якого предмета цих
                        Умов використання або пов'язаних з ним умов, договорів, угод за будь-які непрямі
                        або випадкові збитки, включаючи, крім іншого, втрату доходів і прибутку
                        або за обставини, що виникли в результаті форс-мажору.
                    </p>

                    <p>
                        Крім випадків, прямо зазначених у Договорі публічної оферти,
                        Adrenaline Drive відмовляється від усіх заяв, гарантій і умов, неявних
                        або інших, що виникають у зв'язку з законом, торговими звичаями,
                        діловими відносинами або іншим чином, включаючи гарантії комерційної цінності
                        або придатності для конкретної мети Послуг Adrenaline Drive.
                    </p>

                    <p>
                        Ніякі заяви будь-якого роду, зроблені Adrenaline Drive,
                        які прямо не вказані в цих Умовах або Договорі публічної оферти
                        або в будь-якій письмовій додатковій угоді до нього,
                        не є обов'язковими для Adrenaline Drive.
                    </p>

                    <p>
                        Adrenaline Drive не несе відповідальності за збитки,
                        що виникають в результаті використання, неправильного використання,
                        неможливості використання Веб-сайту та Контенту з будь-якої причини.
                        Таке обмеження застосовується в межах, максимально дозволених законом.
                    </p>

                    <h1>Форс мажор</h1>

                    <p>
                        Жодна із сторін не несе відповідальності перед іншою стороною
                        за будь-яку затримку або невиконання будь-яких зобов'язань,
                        зазначених в цих Умовах або будь-яких його додатках у зв'язку
                        з обставинами непереборної сили, в т.ч. у зв’язку з рішеннями уряду.
                    </p>
                </div>

                <div className="main__car">
                    <img
                        src={require("../../img/nissan.png")}
                        alt="Nissan"
                        className="car__nissan"/>
                </div>

                <div className="main__3">
                    <h1>Відшкодування збитків</h1>

                    <p>
                        Ви погоджуєтесь відшкодовувати Adrenaline Drive
                        і його посадовим особам будь-які збитки, витрати, штрафи і витрати,
                        що виникають у зв'язку з порушенням вами будь-якого закону,
                        порушенням будь-яких положень цих Умов використання або претензіями третіх осіб,
                        пов'язаних з використанням Послуг Adrenaline Drive.
                    </p>

                    <p>
                        У разі нанесення збитків майну Adrenaline Drive або третіх осіб,
                        ви зобов'язуєтеся відшкодувати завдані збитки і звільняєте Adrenaline Drive
                        і його представників від відповідальності перед третіми особами,
                        яким завдано збитків.
                    </p>

                    <h1>Сторонні продукти і посилання</h1>

                    <p>
                        Сайт може містити пропозиції, продукти і послуги третіх осіб,
                        а також посилання на інші сайти.
                        Adrenaline Drive не несе відповідальності за будь-які продукти
                        або послуги третіх сторін, а також за зміст
                        або політику конфіденційності таких третіх сторін.
                        Перед використанням сторонніх сайтів рекомендується прочитати
                        і зрозуміти положення та умови цих сайтів / продуктів / послуг
                        і політику конфіденційності, щоб переконатися, що ви згодні з їх умовами.
                    </p>

                    <h1>Чинне Законодавство</h1>

                    <p>
                        Ці Умови використання та правовідносини між сторонами регулюються
                        і тлумачаться відповідно до законодавства України.
                        Сторони повинні докладати всіх зусиль для врегулювання всіх суперечок
                        шляхом переговорів.
                    </p>

                    <p>
                        Якщо будь-яке положення цих Умов використання є або стає незаконним,
                        нездійсненним або недійсним (повністю або частково за будь-якої причини),
                        інша частина Умов використання залишається в повній силі
                        і дії і не визнається недійсною будь-яким чином.
                    </p>

                    <h1>Зміни</h1>

                    <p>
                        Adrenaline Drive може змінити ці Умови використання
                        та будь-які інші політики на нашому Веб-сайті в будь-який час
                        і розміщення змінених умов або політик на нашому Веб-сайті
                        є достатнім повідомленням про такі зміни.
                        Оновлена версія вступає в силу негайно
                        і буде відзначена оновленою датою в кінці такого документа.
                        Ви не повинні продовжувати використовувати Веб-сайт
                        або послуги Adrenaline Drive, якщо ви не приймаєте такі зміни.
                    </p>

                    <h1>Контакти</h1>

                    <p>
                        Якщо у вас є питання, що стосуються використання цього Веб-сайту
                        або послуг Adrenaline Drive будь ласка зв'яжіться з нами
                        за адресою електронної пошти:⠀<br/><br/>
                        <a href="mailto:info@a-drive.com.ua">info@a-drive.com.ua</a>
                    </p>

                    <p>Остання зміна 18 квітня 2020</p>
                </div>
            </div>
        )
    }
}

export default Main